In [1]:
# importing libraries
import pandas as pd
import numpy as np

In [3]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

print(s1,s2,s3)

0     1
1     2
2     1
3     4
4     2
5     3
6     3
7     3
8     1
9     1
10    2
11    1
12    1
13    4
14    4
15    4
16    2
17    2
18    3
19    1
20    4
21    1
22    1
23    3
24    3
25    3
26    3
27    1
28    4
29    1
     ..
70    4
71    2
72    3
73    2
74    3
75    3
76    3
77    2
78    3
79    4
80    1
81    1
82    1
83    1
84    4
85    2
86    3
87    4
88    1
89    3
90    4
91    1
92    3
93    3
94    3
95    3
96    4
97    3
98    3
99    4
dtype: int32 0     2
1     3
2     2
3     3
4     2
5     3
6     2
7     3
8     3
9     2
10    2
11    3
12    1
13    3
14    2
15    1
16    2
17    1
18    1
19    2
20    2
21    1
22    3
23    1
24    3
25    1
26    1
27    1
28    2
29    2
     ..
70    2
71    2
72    3
73    1
74    2
75    3
76    1
77    3
78    1
79    1
80    1
81    1
82    2
83    1
84    3
85    2
86    1
87    2
88    1
89    1
90    2
91    3
92    3
93    2
94    2
95    1
96    2
97    1
98    2
99    1
dtype: int32 0     28901
1     12697
2     14207
3     26441
4     21971
5     17767
6     26073
7     29884
8     12179
9     11918
10    23329
11    11717
12    16797
13    24074
14    15094
15    13219
16    28542
17    26637
18    14107
19    16636
20    17149
21    29589
22    13988
23    23875
24    10542
25    24454
26    23960
27    26753
28    18799
29    14027
      ...
70    22862
71    27508
72    29723
73    11002
74    26137
75    17184
76    11139
77    25435
78    18005
79    26178
80    11020
81    21488
82    20487
83    11021
84    25927
85    21185
86    23949
87    25173
88    13051
89    26802
90    11829
91    26923
92    27407
93    21114
94    18304
95    17461
96    18677
97    26943
98    27443
99    24205
dtype: int32

In [4]:
# create a DataFrame by joinning the Series by column
df = pd.concat([s1,s2,s3], axis=1)
df.head()

   0  1      2
0  1  2  28901
1  2  3  12697
2  1  2  14207
3  4  3  26441
4  2  2  21971

In [5]:
# Change the name of the columns to bedrs, bathrs, price_sqr_meter
df.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=1)
df.head()

   bedrs  bathrs  price_sqr_meter
0      1       2            28901
1      2       3            12697
2      1       2            14207
3      4       3            26441
4      2       2            21971

In [10]:
# Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'
bigColumn = pd.concat([s1,s2,s3], axis=0) # Series
type(bigColumn)
bigColumn = bigColumn.to_frame()
type(bigColumn)

pandas.core.frame.DataFrame

In [14]:
#  Reindex the DataFrame so it goes from 0 to 299
bigColumn.tail()

         0
295  17461
296  18677
297  26943
298  27443
299  24205

In [13]:

bigColumn.reset_index(drop=1, inplace=1)
bigColumn.tail()

         0
295  17461
296  18677
297  26943
298  27443
299  24205